OpenFOAM-v2112/tank15-t153-M3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.075  -0.075 -0.80)
    ( 0.075  -0.075 -0.80)
    ( 0.075   0.075 -0.80)
    (-0.075   0.075 -0.80)
    (-0.075  -0.075  0.60)
    ( 0.075  -0.075  0.60)
    ( 0.075   0.075  0.60)
    (-0.075   0.075  0.60)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 280) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    sidesZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    sidesX
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    sidesY
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
